{
  "user_input": "Modify the TJ Sectoral Model. Add Nuclear SMR Generators in Germany DE01, DE03, and in Austria AT01. Add the properties and use a max capacity of 1000 MW. I'm testing my DAGs ability to process a list of objects, so the addition of the generators in a DAG task.",
  "author": "Dante",
  "tags": [
    "crud",
    "generator",
    "batch",
    "update",
    "properties",
    "Germany",
    "Austria",
    "TJ Sectoral Model",
    "Nuclear SMR"
  ],
  "date_created": "2025-08-23",
  "time_created": "23:58:55",
  "retry_policy": {
    "count": 1,
    "strategy": "fixed"
  },
  "default_llm_context": "Perform the specified operation based on the user's input and the Terajoule Model specifications. Use pipelines for PLEXOS CRUD on categories, objects, memberships, properties and attributes within the TJ Sectoral Model.",
  "tasks": [
    {
      "task_name": "crud_create_generators_batch",
      "pipeline_name": "crud_pipeline.json",
      "description": "Create Generator objects with technology Nuclear SMR in the TJ Sectoral Model for regions DE01, DE03 (Germany) and AT01 (Austria) as a single batch/list operation.",
      "target_level": "object",
      "strategy_action": "create",
      "entity_selection_context": "Create three Generator objects in the TJ Sectoral Model as one batch. For each region in [DE01, DE03, AT01]: set Object Type = Generator, Technology = Nuclear SMR, Object Name = '<Region> Nuclear SMR'. Link each generator to its corresponding Region object if region membership is required by the model.",
      "on_error": "abort"
    },
    {
      "task_name": "crud_update_max_capacity",
      "pipeline_name": "crud_pipeline.json",
      "description": "Set the Max Capacity property to 1000 MW for the newly created Nuclear SMR Generator objects in regions DE01, DE03, and AT01.",
      "target_level": "property",
      "strategy_action": "update",
      "entity_selection_context": "Select the Generator objects created in the previous task within the TJ Sectoral Model named: DE01 Nuclear SMR, DE03 Nuclear SMR, AT01 Nuclear SMR. Update Property = Max Capacity with Value = 1000 and Units = MW.",
      "on_error": "log_and_continue"
    }
  ]
}