{
  "user_input": "Modify the DHEM model. \n    o\tGet the datafile attribute for the Gas Pipeline Capacity data file for the PCIPMI infrastrucutre level (use crud pipeline)\n    o\tCreate a variation of the Gas Pipeline Capacity data file for the PCIPMI infrastrucutre level by setting all values that aren't 0 to 999. Copy the H2\\Gas.\n    o\tCreate a new datafile object in the Datafile class using the Gas Pipeline category call it something relating to PCIPMI capacities Unlimited. Add the filename property with the name of the datafile just created.\n    o\tAdd a scenario called unlimited_pci_pmi_pipeline_capacities\n    o\tAdd a max flow property to each object in the H2 inteconnection and H2 Internal bottleneck categories in the gas pipeline class, with the datafile and scenario created in the previous step. Use the crud pipeline\n    o\tClone the model \"DHEM_v41_2030_PCIPMI_1995\" and add the new scenario. Call the model “DHEM_v41_2030_PCIPMI_1995_unlmtd_pipeline”",
  "author": "Dante",
  "tags": [
    "modify",
    "DHEM",
    "crud",
    "clone",
    "pipeline"
  ],
  "date_created": "2025-07-28",
  "time_created": "13:18:51",
  "retry_policy": {
    "count": 1,
    "strategy": "fixed"
  },
  "default_llm_context": "Perform the specified operation based on the user's input and the Terajoule Model specifications.",
  "tasks": [
    {
      "task_name": "perform_crud_operation",
      "pipeline_name": "crud_pipeline.json",
      "description": "Retrieve the datafile attribute for the Gas Pipeline Capacity data file for the PCIPMI infrastructure level using the CRUD pipeline.",
      "target_level": "attribute",
      "strategy_action": "read",
      "entity_selection_context": "Based on the user's request to modify the DHEM model, select the correct datafile attribute from the PCIPMI infrastructure level in the Gas Pipeline Capacity data file.",
      "on_error": "abort"
    },
    {
      "task_name": "modify_data_file",
      "function_name": "modify_data_file",
      "function_args": {
        "plexos_model_location": "",
        "input_file_path": "H2\\Gas",
        "user_input": "Set all values that are not 0 to 999",
        "output_file_path": ""
      },
      "description": "Create a variation of the Gas Pipeline Capacity data file for the PCIPMI infrastructure level by setting all non-zero values to 999. Copy the data from H2\\Gas.",
      "target_level": "file",
      "strategy_action": "update",
      "entity_selection_context": "Based on the user's request, modify and generate a new data file with updated capacity values.",
      "on_error": "log_and_continue"
    },
    {
      "task_name": "add_object",
      "pipeline_name": "crud_pipeline.json",
      "description": "Create a new datafile object in the Datafile class using the Gas Pipeline category, naming it to reflect 'PCIPMI capacities Unlimited'.",
      "target_level": "object",
      "strategy_action": "create",
      "entity_selection_context": "Based on the user's request, create a new datafile object in the Gas Pipeline category with a name indicating unlimited capacities.",
      "on_error": "abort"
    },
    {
      "task_name": "update_properties_with_grouped_llm",
      "pipeline_name": "crud_pipeline.json",
      "description": "Update the newly created datafile object by adding the filename property with the name of the datafile just created.",
      "target_level": "property",
      "strategy_action": "update",
      "entity_selection_context": "Based on the user's request, update the properties of the new datafile object to include the filename.",
      "on_error": "abort"
    },
    {
      "task_name": "add_object",
      "pipeline_name": "crud_pipeline.json",
      "description": "Add a new scenario object called 'unlimited_pci_pmi_pipeline_capacities'.",
      "target_level": "object",
      "strategy_action": "create",
      "entity_selection_context": "Based on the user's request, create a new scenario for unlimited PCI PMI pipeline capacities.",
      "on_error": "abort"
    },
    {
      "task_name": "update_properties_with_grouped_llm",
      "pipeline_name": "crud_pipeline.json",
      "description": "Add a max flow property to each object in the H2 interconnection and H2 Internal bottleneck categories in the Gas Pipeline class, linking the property to the previously created datafile and scenario.",
      "target_level": "property",
      "strategy_action": "update",
      "entity_selection_context": "Based on the user's request, update the max flow properties in the specified categories using the newly created datafile and scenario.",
      "on_error": "abort"
    },
    {
      "task_name": "clone_pipeline",
      "pipeline_name": "clone_pipeline.json",
      "description": "Clone the model 'DHEM_v41_2030_PCIPMI_1995' using the clone pipeline, add the new scenario, and rename the cloned model to 'DHEM_v41_2030_PCIPMI_1995_unlmtd_pipeline'.",
      "target_level": "object",
      "strategy_action": "clone",
      "entity_selection_context": "Based on the user's request, clone the model and integrate the new scenario accordingly.",
      "on_error": "abort"
    }
  ]
}