{
  "user_input": "Modify the DHEM model. Use the CRUD pipeline for all except task 2, where the modify data file function should be used.\n1. Get the datafile attribute for the Gas Pipeline Capacity data file for the PCIPMI infrastructure level (use crud pipeline).\n2. Create a variation of the Gas Pipeline Capacity data file for the PCIPMI infrastructure level by setting all values that aren't 0 to 999. Copy the H2\\Gas.\n3. Create a new datafile object in the Datafile class using the Gas Pipeline category; call it something relating to PCIPMI capacities Unlimited.\n4. Add the filename property with the name of the datafile just created in step 2.\n5. Add a scenario called unlimited_pci_pmi_pipeline_capacities.\n6. Add a max flow property to each object in the H2 interconnection and H2 Internal bottleneck categories in the gas pipeline class, with the datafile and scenario created in the previous step (use crud pipeline).\n7. Clone the model \"DHEM_v41_2030_PCIPMI_1995\" and add the new scenario, then rename the cloned model to \"DHEM_v41_2030_PCIPMI_1995_unlmtd_pipeline\".",
  "author": "Dante",
  "tags": [
    "DHEM",
    "crud",
    "modify",
    "datafile",
    "pipeline"
  ],
  "date_created": "2025-07-28",
  "time_created": "20:15:20",
  "retry_policy": {
    "count": 1,
    "strategy": "fixed"
  },
  "default_llm_context": "Perform the specified operation based on the user's input and the Terajoule Model specifications.",
  "tasks": [
    {
      "task_name": "get_datafile_attribute",
      "pipeline_name": "crud_pipeline.json",
      "description": "Retrieve the datafile attribute for the Gas Pipeline Capacity data file for the PCIPMI infrastructure level using the CRUD pipeline.",
      "target_level": "attribute",
      "strategy_action": "read",
      "entity_selection_context": "Based on the user's request, select the appropriate datafile attribute from the available list.",
      "on_error": "abort"
    },
    {
      "task_name": "create_variation_of_datafile",
      "function_name": "modify_data_file",
      "description": "Create a variation of the Gas Pipeline Capacity data file for the PCIPMI infrastructure level by setting all non-zero values to 999 and copying the H2\\Gas data.",
      "target_level": "file",
      "strategy_action": "update",
      "entity_selection_context": "Based on the user's request, select the relevant data file for modification.",
      "on_error": "log_and_continue",
      "function_args": {
        "plexos_model_location": "",
        "input_file_path": "H2\\Gas Pipeline\\Capacities_H2_Year_FID+PCI+PMI.csv",
        "user_input": "set all values that aren't 0 to 999",
        "output_file_path": ""
      }
    },
    {
      "task_name": "create_new_datafile_object",
      "pipeline_name": "crud_pipeline.json",
      "description": "Create a new datafile object in the Datafile class using the Gas Pipeline category; name it with reference to PCIPMI capacities Unlimited.",
      "target_level": "object",
      "strategy_action": "create",
      "entity_selection_context": "Based on the user's request, choose the appropriate naming structure for the new datafile object.",
      "on_error": "abort"
    },
    {
      "task_name": "add_filename_property",
      "pipeline_name": "crud_pipeline.json",
      "description": "Add the filename property to the datafile object created in step 2, using the name of the newly modified datafile.",
      "target_level": "property",
      "strategy_action": "update",
      "entity_selection_context": "Based on the user's request, select the datafile object that needs the filename property updated.",
      "on_error": "abort"
    },
    {
      "task_name": "add_new_scenario",
      "pipeline_name": "crud_pipeline.json",
      "description": "Add a scenario called 'unlimited_pci_pmi_pipeline_capacities' using the CRUD pipeline.",
      "target_level": "object",
      "strategy_action": "create",
      "entity_selection_context": "Based on the user's request, select the suitable scenario template for creation.",
      "on_error": "abort"
    },
    {
      "task_name": "add_max_flow_property",
      "pipeline_name": "crud_pipeline.json",
      "description": "Add a max flow property to each object in the H2 interconnection and H2 Internal bottleneck categories in the gas pipeline class, associating the property with the previously created datafile and scenario.",
      "target_level": "property",
      "strategy_action": "update",
      "entity_selection_context": "Based on the user's request, select the objects in the specified categories and update their properties accordingly.",
      "on_error": "abort"
    },
    {
      "task_name": "clone_and_rename_model",
      "pipeline_name": "clone_pipeline.json",
      "description": "Clone the model 'DHEM_v41_2030_PCIPMI_1995', add the new scenario, and rename the cloned model to 'DHEM_v41_2030_PCIPMI_1995_unlmtd_pipeline'.",
      "target_level": "object",
      "strategy_action": "clone",
      "entity_selection_context": "Based on the user's request, select the correct model for cloning and ensure the new scenario is applied.",
      "on_error": "abort"
    }
  ]
}