{
  "user_input": "Modify the DHEM model. Use the CRUD pipeline for all except task 2, where the modify data file function should be used.\n\n1. Get the datafile attribute for the Gas Pipeline Capacity data file for the PCIPMI infrastructure level (use crud pipeline).\n2. Create a variation of the Gas Pipeline Capacity data file for the PCIPMI infrastructure level by setting all values that aren't 0 to 999. Copy the H2\\Gas.\n3. Create a new datafile object in the Datafile class using the Gas Pipeline category call it something relating to PCIPMI capacities Unlimited. Add the filename property with the name of the datafile just created.\n4. Add a scenario called unlimited_pci_pmi_pipeline_capacities.\n5. Add a max flow property to each object in the H2 interconnection and H2 Internal bottleneck categories in the gas pipeline class, with the datafile and scenario created in the previous step. Use the crud pipeline.\n6. Clone the model \"DHEM_v41_2030_PCIPMI_1995\" and add the new scenario. Call the model “DHEM_v41_2030_PCIPMI_1995_unlmtd_pipeline”",
  "author": "Assistant",
  "tags": [
    "CRUD",
    "datafile",
    "modify",
    "clone",
    "scenario"
  ],
  "date_created": "2025-07-28",
  "time_created": "19:45:28",
  "retry_policy": {
    "count": 1,
    "strategy": "fixed"
  },
  "default_llm_context": "Perform the specified operation based on the user's input and the Terajoule Model specifications.",
  "tasks": [
    {
      "task_name": "perform_crud_operation",
      "pipeline_name": "crud_pipeline.json",
      "description": "Get the datafile attribute for the Gas Pipeline Capacity data file for the PCIPMI infrastructure level using the CRUD pipeline.",
      "target_level": "attribute",
      "strategy_action": "read",
      "entity_selection_context": "Based on the user's request, select the relevant attribute from the Gas Pipeline Capacity data file for the PCIPMI infrastructure level.",
      "on_error": "abort"
    },
    {
      "task_name": "modify_data_file",
      "function_name": "modify_data_file",
      "description": "Create a variation of the Gas Pipeline Capacity data file for the PCIPMI infrastructure level by setting all values that aren't 0 to 999. Copy the H2\\Gas file.",
      "target_level": "file",
      "strategy_action": "update",
      "entity_selection_context": "Based on the user's request, modify the data file by replacing non-zero values with 999 and copying the H2\\Gas file.",
      "on_error": "log_and_continue",
      "function_args": {
        "plexos_model_location": "",
        "input_file_path": "H2\\Gas Pipeline Capacity data file.csv",
        "user_input": "set all values that aren't 0 to 999",
        "output_file_path": "H2\\Gas Pipeline Capacity data file_UNLIMITED.csv"
      },
      "function_kwargs": {}
    },
    {
      "task_name": "perform_crud_operation",
      "pipeline_name": "crud_pipeline.json",
      "description": "Create a new datafile object in the Datafile class using the Gas Pipeline category named for PCIPMI capacities Unlimited and add the filename property with the name of the datafile just created.",
      "target_level": "object",
      "strategy_action": "create",
      "entity_selection_context": "Based on the user's request, create a new Datafile object for PCIPMI capacities Unlimited in the Gas Pipeline category and attach its filename property.",
      "on_error": "abort"
    },
    {
      "task_name": "perform_crud_operation",
      "pipeline_name": "crud_pipeline.json",
      "description": "Add a scenario called unlimited_pci_pmi_pipeline_capacities using the CRUD pipeline.",
      "target_level": "object",
      "strategy_action": "create",
      "entity_selection_context": "Based on the user's request, create a new scenario entry named unlimited_pci_pmi_pipeline_capacities.",
      "on_error": "abort"
    },
    {
      "task_name": "perform_crud_operation",
      "pipeline_name": "crud_pipeline.json",
      "description": "Add a max flow property to each object in the H2 interconnection and H2 Internal bottleneck categories in the gas pipeline class, linking them to the datafile and scenario created in the previous steps.",
      "target_level": "property",
      "strategy_action": "create",
      "entity_selection_context": "Based on the user's request, add a max flow property to the objects in the H2 interconnection and H2 Internal bottleneck categories, and link them to the newly created datafile and scenario.",
      "on_error": "abort"
    },
    {
      "task_name": "clone_pipeline",
      "pipeline_name": "clone_pipeline.json",
      "description": "Clone the model 'DHEM_v41_2030_PCIPMI_1995' and add the new scenario, renaming the clone to 'DHEM_v41_2030_PCIPMI_1995_unlmtd_pipeline'.",
      "target_level": "object",
      "strategy_action": "clone",
      "entity_selection_context": "Based on the user's request, clone the specified model and attach the new scenario.",
      "on_error": "abort"
    }
  ]
}